import moment from 'moment';
import { useMemo } from 'react';

const MENU = {
	'01': {
		breakfast: ['Омлет натуральный на молоке', 'Батон нарезной', 'Чай с сахаром', 'Яблоко'],
		lunch: ['Огурец', 'Суп гороховый', 'Соус Бешамель', 'Макаронник с печенью', 'Хлеб пшеничный', 'Компот из сухофруктов с вит.C']
	},
	'02': { breakfast: [], lunch: [] },
	'03': { breakfast: [], lunch: [] },
	'04': {
		breakfast: [
			'Запеканка творожная с морковью',
			'Соус абрикосовый',
			'Батон нарезной',
			'Чай с черной смородиной и облепихой с медом',
			'Пряник'
		],
		lunch: [
			'Огурец',
			'Уха с крупой (филе горбуши)',
			'Котлета куриная запеченая с маслом',
			'Макароны',
			'Хлеб пшеничный',
			'Компот из сухофруктов с вит.C'
		]
	},
	'05': {
		breakfast: [
			'Котлета домашняя тушеная в томатном соусе',
			'Гречка отварная с маслом',
			'Бутерброд с маслом, сыром',
			'Чай с лимоном, сахаром'
		],
		lunch: ['Помидор', 'Щи из свежей капусты с картофелем со сметаной', 'Плов с курицей (филе)', 'Хлеб пшеничный', 'Компот из облепихи']
	},
	'06': { breakfast: [], lunch: [] }
};

const START_WEEK = moment(new Date(2020, 8, 31)).isoWeek();

export const getMenu = (dt = moment()) => {
	console.log('getMenu', dt);
	const w = (dt.isoWeek() - START_WEEK) % 4;
	const d = dt.day();
	console.log('w', w, 'd', d, 'w+d', '' + w + d);
	return MENU['' + w + d];
};

export const useMenu = dt => {
	const retval = useMemo(() => getMenu(dt), [dt]);
	return retval;
};
